---
type: RebarShapeConstraintRadius
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 2
tags: [revit-api, class]
---

# RebarShapeConstraintRadius

`Autodesk.Revit.DB.Structure.RebarShapeConstraintRadius` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RebarShapeConstraintRadius | 2012 | `public RebarShapeConstraintRadius ( ElementId paramId , RebarShapeArcReferenceType refType )` |
| Property | ArcReferenceType | 2012 | `public RebarShapeArcReferenceType ArcReferenceType { get ; }` |